emoji_dict = {
    # Caritas felices
    ":)": "😊",
    ":-)": "😊",
    "=)": "😊",
    ":D": "😄",
    ":-D": "😄",
    "=D": "😄",
    ":]": "😊",
    "(:": "😊",

    # Caritas tristes
    ":(": "☹️",
    ":-(": "☹️",
    "=(":"☹️",
    ":[": "☹️",

    # Guiños
    ";)": "😉",
    ";-)": "😉",
    "*-)": "😉",

    # Lengua afuera / juguetón
    ":P": "😛",
    ":-P": "😛",
    ":p": "😛",
    ":-p": "😛",

    # Sorpresa / asombro
    ":O": "😮",
    ":-O": "😮",
    ":o": "😮",
    ":-o": "😮",

    # Besos / amor
    ":*": "😘",
    ":-*": "😘",
    "<3": "❤️",

    # Malos / enojados
    ">:(": "😠",
    ":-/": "😕",
    ":/": "😕",
    ":|": "😐",
    ":-|": "😐",

    # Llanto
    ":'(": "😢",
    "T_T": "😭",
    ":'-)": "😂",

    # Risas
    "xD": "😆",
    "XD": "😆",
    "xDD": "😆",

    # Aburrido / indiferente
    "-_-": "😑",
    "=_=": "😑",

    # Pensativo / confuso
    ":?": "🤔",

    # Fiestas / celebraciones
    ":party:": "🥳",

    # Animales
    ":3": "😺",
    "^-^": "😸",

    # Ojos grandes / sorpresa tierna
    "O_O": "😳",

    # Miedo / shock
    "D:": "😨",

    # Dormido / cansado
    "-.-": "😴",
    "zZz": "😴",

    # Enfermo
    ">:O": "🤢",

    # Otros
    ":v": "✌️",
    ":^)": "😏",
    ":$": "😳",
    ":-X": "🤐",
    "xP": "😛",
    ":3": "😺",
}
